function content_load(buttonId) {
    let content = '';

    switch (buttonId) {
        case 'btn1':
            content = `
            <h1>Лабораторна робота №4</h1>
           
                Тема: АДАПТИВНА ВЕРСТКА. МЕДІА-ЗАПИТИ. МЕТАТЕГ VIEWPORT. СТРАТЕГІЯ MOBILE FIRST.  

            </p>
            <p>
                Мета: Адаптивна верстка. Медіа-запити. Медіа-типи. Медіа-функції.Метатег viewport. Інструменти розробника. Стратегія Mobile First. 

            </p>
            <h3>ЛР_4:</h3>
            <a href ="https://github.com/Kynefa/Lp3_3" target="_blank">репозиторій</a> і
            <a href ="http://127.0.0.1:5502/index.html" target="_blank">живий сайт</a>
            <h3>Звіт:</h3>
            <a href ="https://github.com/Kynefa/zvit" target="_blank">репозиторій</a> і
            <a href ="http://127.0.0.1:5501/index.html" target="_blank">живий сайт</a>
            `;
            break;

        case 'btn2':
            content = `<textarea rows="20" cols="150">
         Десктопна версія (ширина екрана більше ніж 992px):
Це версія сайту для великих екранів (моніторів або ноутбуків)
Ширина блоку контенту може бути обмежена, щоб не розтягувати сайт занадто широко (наприклад, до 1200px).
Карти (товари) розташовуються у кілька колонок, з відступами між ними.
Навігація виводиться у повний розмір і вирівнюється за правим краєм.


Планшетна версія (ширина екрана від 768px до 991px):
Планшети мають менші екрани, тому макет потрібно адаптувати, щоб забезпечити читабельність і зручність користування. Блоки можуть бути ширшими, а відступи меншими.
Відступи з боків зменшуються, щоб більше контенту вміщалося на екрані.
Карти товарів розташовані в дві колонки.
Елементи навігації можуть бути більш компактними.


Мобільна версія (ширина екрана до 767px):
Для мобільних пристроїв необхідно спрощувати інтерфейс. Контент повинен розташовуватись вертикально, великі блоки стають меншими, а текст та кнопки – більш читабельними.
Відступи зменшуються до 80px для зручності перегляду.
Всі блоки розташовані вертикально (одноколонковий макет).
Карти товарів займають 100% ширини екрану, щоб легко взаємодіяти з ними на мобільних пристроях.
Меню навігації також розташоване вертикально для зручності.
            </textarea>`;
            break;
        case 'btn3':
            content = `
               
                `;
            break;
        case 'btn4':
            content = `
               
             `;
            break;
        case 'btn5':
            content = `
                   
              `;
            break;
        case 'btn6':
            content = `
               <p> and — застосування стилів за умови виконання всіх умов.<br>
not — застосування стилів, якщо умова не виконується.<br>
, — застосування стилів, якщо виконується будь-яка з умов.<p>
             `;
            break;
        case 'btn7':
            content = `
               
             `;
            break;

    }

    const output = document.getElementsByClassName('output')[0];

    output.innerHTML = content;
    document.querySelectorAll('button').forEach(button => {
        button.addEventListener('click', (event) => {
            content_load(event.target.id);
        });
    });
}